config/cf/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/CommonModules/ШтрихкодированиеНоменклатурыКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработатьНеизвестныеШтрихкоды(СтруктураПараметровДействия, КэшированныеЗначения, ФормаВладелец) Экспорт
	
	Если СтруктураПараметровДействия.НеизвестныеШтрихкоды.Количество() > 0
		И Не СтруктураПараметровДействия.ШтрихкодыВТЧ Тогда
		
		Если Не (КэшированныеЗначения.ПравоРегистрацииШтрихкодовНоменклатурыДоступно
			И СтруктураПараметровДействия.РегистрироватьНовыеШтрихкоды
			И СтруктураПараметровДействия.ИзменятьКоличество)Тогда
			
			Если СтруктураПараметровДействия.УчитыватьУпаковочныеЛисты Тогда
				ШаблонСообщения = НСтр("ru = 'Номенклатура или упаковочный лист со штрихкодом %1% не найдены'");
			Иначе
				ШаблонСообщения = НСтр("ru = 'Номенклатура со штрихкодом %1% не найдена'");
			КонецЕсли;
			Для Каждого ТекНеизвестныйШтрихкод Из СтруктураПараметровДействия.НеизвестныеШтрихкоды Цикл
				
				СтрокаСообщения = СтрЗаменить(ШаблонСообщения, "%1%", СокрЛП(ТекНеизвестныйШтрихкод.Штрихкод));
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
				
			КонецЦикла;
		Иначе
			ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры", СтруктураПараметровДействия, ФормаВладелец, Новый УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыОбработкиШтрихкодов() Экспорт
	
	СтруктураОбработкиШтрихкода = Новый Структура;
	СтруктураОбработкиШтрихкода.Вставить("Штрихкоды",                                          Неопределено);
	СтруктураОбработкиШтрихкода.Вставить("СтруктураДействийСДобавленнымиСтроками",             Неопределено);
	СтруктураОбработкиШтрихкода.Вставить("СтруктураДействийСИзмененнымиСтроками",              Неопределено);
	СтруктураОбработкиШтрихкода.Вставить("СтруктураДействийСоСтрокамиИзУпаковочныхЛистов",     Неопределено);
	СтруктураОбработкиШтрихкода.Вставить("ПараметрыУказанияСерий",                 Неопределено);
	СтруктураОбработкиШтрихкода.Вставить("РегистрироватьНовыеШтрихКоды",           Истина);
	СтруктураОбработкиШтрихкода.Вставить("ИмяКолонкиКоличество",                   "КоличествоУпаковок");
	СтруктураОбработкиШтрихкода.Вставить("НеИспользоватьУпаковки",                 Ложь);
	СтруктураОбработкиШтрихкода.Вставить("ИмяТЧ",                                  "Товары");
	СтруктураОбработкиШтрихкода.Вставить("ИзменятьКоличество",                     Истина);
	СтруктураОбработкиШтрихкода.Вставить("БлокироватьДанныеФормы",                 Истина);
	СтруктураОбработкиШтрихкода.Вставить("ТолькоТовары",                           Ложь);
	СтруктураОбработкиШтрихкода.Вставить("ТолькоУслуги",                           Ложь);
	СтруктураОбработкиШтрихкода.Вставить("ТолькоТара",                             Ложь);
	СтруктураОбработкиШтрихкода.Вставить("ТолькоНеПодакцизныйТовар",               Ложь);
	СтруктураОбработкиШтрихкода.Вставить("НеизвестныеШтрихкоды",                   Новый Массив);
	СтруктураОбработкиШтрихкода.Вставить("ОтложенныеТовары",                       Новый Массив);
	СтруктураОбработкиШтрихкода.Вставить("ПараметрыПроверкиАссортимента",          Неопределено);
	СтруктураОбработкиШтрихкода.Вставить("РассчитыватьНаборы",                     Ложь);
	СтруктураОбработкиШтрихкода.Вставить("УчитыватьУпаковочныеЛисты",              Ложь);
	СтруктураОбработкиШтрихкода.Вставить("ОтработатьИзменениеУпаковочныхЛистов",   Ложь);
	СтруктураОбработкиШтрихкода.Вставить("ШтрихкодыВТЧ",                           Ложь);
	СтруктураОбработкиШтрихкода.Вставить("УвеличиватьКоличествоВСтрокахССериями",  Истина);
	СтруктураОбработкиШтрихкода.Вставить("ТекущийУпаковочныйЛист",                 Неопределено);
	СтруктураОбработкиШтрихкода.Вставить("ЗаполнятьНазначения",                    Ложь);
	
	//Возвращаемые параметры
	СтруктураОбработкиШтрихкода.Вставить("МассивСтрокССериями", Новый Массив);
	СтруктураОбработкиШтрихкода.Вставить("ТекущаяСтрока",       Неопределено);
	
	Возврат СтруктураОбработкиШтрихкода;
	
КонецФункции

//Определяет необходимость открытия формы указания серий после обработки штрихкодов. Форму нужно
//открывать, если был отсканирован один штрихкод товара, по которому ведется учет серий
//
//	Параметры:
//		 ПараметрыОбработкиШтрихкодов - Структура - см. ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов()
//
//	Возвращаемое значение:
//		Булево
//
Функция НужноОткрытьФормуУказанияСерийПослеОбработкиШтрихкодов(ПараметрыОбработкиШтрихкодов) Экспорт
	
	Возврат Ложь;
	
КонецФункции

//Возвращает структуру, которая затем обрабатывается процедурами заполнения ТЧ
//Параметры:
//		Штрихкод - штрихкод, который необходимо обработать
//		Количество - количество товаров с указанным штрихкодом
//
Функция ПолучитьСтруктуруДанныхШтрихкода(Штрихкод, Количество) Экспорт

	Возврат Новый Структура("Штрихкод, Количество", Штрихкод, Количество);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
